Section 12 University App/my_app/app/controllers/application_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_user
        @current_user ||= Student.find(session[:student_id]) if session[:student_id]