Section 12 University App/my_app/app/controllers/logins_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."email" = ? LIMIT ?  [["email", "pojan@gmail.com"], ["LIMIT", 1]]
---
    def create
        student = Student.find_by(email: params[:logins][:email].downcase)