Section 12 University App/my_app/app/controllers/student_courses_controller.rb

    def create
        course_to_add = Course.find(params[:course_id])
        unless current_user.courses.include?(course_to_add)
            StudentCourse.create(student: current_user, course: course_to_add)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "courses" INNER JOIN "student_courses" ON "courses"."id" = "student_courses"."course_id" WHERE "student_courses"."student_id" = ? AND "courses"."id" = ? LIMIT ?  [["student_id", 1], ["id", 2], ["LIMIT", 1]]
INSERT INTO "student_courses" ("student_id", "course_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["student_id", 1], ["course_id", 2], ["created_at", "2023-01-07 12:41:32.300581"], ["updated_at", "2023-01-07 12:41:32.300581"]]