Section 12 University App/my_app/app/controllers/students_controller.rb

INSERT INTO "students" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
    def create
        @student = Student.new(student_params)
        if @student.save

UPDATE "students" SET "name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "Pojan 3 New"], ["updated_at", "2023-01-07 08:51:29.038617"], ["id", 3]]
---
    def update
        if @student.update(student_params)