Section 12 University App/my_app/app/views/students/show.html.erb

                <p>Course Enrollments:
                    <% if @student.courses.empty?%>
---
SELECT "courses".* FROM "courses" INNER JOIN "student_courses" ON "courses"."id" = "student_courses"."course_id" WHERE "student_courses"."student_id" = ?  [["student_id", 1]]
SELECT  1 AS one FROM "courses" INNER JOIN "student_courses" ON "courses"."id" = "student_courses"."course_id" WHERE "student_courses"."student_id" = ? LIMIT ?  [["student_id", 1], ["LIMIT", 1]]

                <ul>
                    <% @student.courses.each do |course| %>
---
SELECT "courses".* FROM "courses" INNER JOIN "student_courses" ON "courses"."id" = "student_courses"."course_id" WHERE "student_courses"."student_id" = ?  [["student_id", 1]]